{
  "settings": {},
  "dependencies": [
    "AE2 Controller"
  ],
  "tasks": {
    "5723EBB3D22A39E7": {
      "type": "heracles:item",
      "item": "ae2:me_p2p_tunnel"
    }
  },
  "rewards": {
    "7EDBD50C41804FD8": {
      "type": "heracles:item",
      "item": {
        "id": "lootbags:loot_bag",
        "count": 1,
        "nbt": {
          "Color": 16747259,
          "Loot": "aof:loot_bags/misc/logistics",
          "Name": "Logistics & Storage Lootbag",
          "Type": "UNCOMMON"
        }
      }
    }
  },
  "display": {
    "title": "Acquire: ae2:me_p2p_tunnel",
    "description": [
      "<h2>A versatile configurable system to move items / redstone / power / and fluids from one location to another though an existing ME Network without storage.</h2>",
      "<hr/>",
      "<task task=\"5723EBB3D22A39E7\" quest=\"ME P2P Tunnel\"/>",
      "<hr/>",
      "Tunnels are 1 input to N outputs. This means you can output to as many points as you want, but only input at a single point per tunnel.",
      "<br/>",
      "Networks can support any number of tunnels, of any different types, and they all function independently.",
      "<br/>",
      "ME Tunnels can be used to carry channels from one location to another, and can carry up to 32 channels, same as a Fluix ME Dense Covered Cable, while only requiring a single channel per point, making tunnels a very powerful tool to expand me networks, especially over a distance.",
      "<br/>",
      "The channel required by a P2P-Tunnel cannot be carried through another P2P-Tunnel.",
      "<br/>",
      "To configure a ME P2P Tunnel you must first attune the tunnel to carry what you want it to, then you need to configure the outputs to their input.",
      "<br/>",
      "You configure the connections by using the Memory Card; First Shift+Right Click the input to save it on your memory card, then simply right-click the different outputs to store the input onto the outputs.",
      "<hr/>",
      "<reward reward=\"7EDBD50C41804FD8\" quest=\"ME P2P Tunnel\"/>"
    ],
    "icon": {
      "type": "heracles:item",
      "item": "ae2:me_p2p_tunnel"
    },
    "subtitle": {
      "text": "A versatile configurable system to move items / redstone / power / and fluids from one location to another though an existing ME Network without storage."
    },
    "groups": {
      "Applied Energistics 2": {
        "position": [
          -352,
          -80
        ]
      }
    }
  }
}