{
  "dependencies": [
    "your_first_bronze"
  ],
  "tasks": {
    "coke_oven_task_4": {
      "type": "heracles:item",
      "amount": 1,
      "collection": "AUTOMATIC",
      "item": "modern_industrialization:bronze_item_output_hatch"
    },
    "coke_oven_task_5": {
      "type": "heracles:item",
      "amount": 1,
      "collection": "AUTOMATIC",
      "item": "modern_industrialization:bronze_fluid_input_hatch"
    },
    "coke_oven_task_6": {
      "type": "heracles:item",
      "amount": 1,
      "collection": "AUTOMATIC",
      "item": "modern_industrialization:bronze_fluid_output_hatch"
    },
    "coke_oven_task_1": {
      "type": "heracles:item",
      "amount": 1,
      "collection": "AUTOMATIC",
      "item": "modern_industrialization:coke_oven"
    },
    "coke_oven_task_2": {
      "type": "heracles:item",
      "amount": 21,
      "collection": "AUTOMATIC",
      "item": "minecraft:bricks"
    },
    "coke_oven_task_3": {
      "type": "heracles:item",
      "amount": 1,
      "collection": "AUTOMATIC",
      "item": "modern_industrialization:bronze_item_input_hatch"
    }
  },
  "rewards": {},
  "display": {
    "subtitle": {
      "text": ""
    },
    "description": [
      "<hr/>",
      "# Coke Oven",
      "<br/>",
      "  The Coke Oven is a large structure, larger than only a single block. This multiblock structure is used to take coal or coal dust and heat it in a location with the absence of air and producing /b/coal coke/b/ and occasionally some creosote. You can use creosote for the production of lubricant and coal coke for steel or just a powerful fuel.",
      "<br/>",
      "  The Coke Oven block here is the role of the central controller. You will place other blocks surrounding it in a pattern that will eventually construct the full multiblock.",
      "<br/>",
      "  Every multiblock is managed by a controller, but you usually cannot interact with the controller directly but instead through input and output hatches that you place in certain spots of the multiblock. ",
      "<br/>",
      "  You'll need a fluid input hatch to handle an input of steam to power the coke oven, an item input hatch as a way to input the coal and an item output hatch to output the coke. A fluid output hatch is not required and will allow the multiblock to run without it, but with it you can extract the creosote from the coal. Normally if you don't have enough of the correct hatches required, the multiblock will not function.",
      "<br/>",
      "  If you hold a wrench, a projection of the blocks needed for the rest of the multiblock will show after you've placed down the controller block. The specific holographic block will disappear if the correct block is placed, or will turn red if the block in that location is incorrect.",
      "<br/>",
      "  If you hold a hatch in your hand, there will be green highlighted location where the hatches can go. If you placed the hatch outside of those highlighted locations, the multiblock will not recognize the hatch.",
      "<br/>",
      "  One the coke oven controller states that it's shape is valid, you can fill the fluid input hatch up with steam. Throwing coal or coal dust into the item input hatch will allow the Coke Oven to fire up and start producing. If it doesn't work, retrace your steps and find out what went wrong.",
      "<hr/>"
    ],
    "groups": {
      "Modern Industrialization": {
        "position": [
          250,
          0
        ]
      }
    },
    "icon": {
      "item": "modern_industrialization:coke_oven",
      "type": "heracles:item"
    },
    "icon_background": "heracles:textures/gui/quest_backgrounds/default.png",
    "title": {
      "translate": "Coke Oven"
    }
  },
  "settings": {
    "individual_progress": false,
    "hidden": false,
    "unlockNotification": false
  }
}