{
  "dependencies": [
    "the_electric_age"
  ],
  "tasks": {
    "energy_transfer_task": {
      "type": "heracles:item",
      "item": "modern_industrialization:tin_cable",
      "amount": 1,
      "collection": "AUTOMATIC",
      "title": "",
      "icon": {
        "item": {
          "id": "minecraft:air",
          "count": 0
        },
        "type": "heracles:item"
      }
    }
  },
  "rewards": {
    "energy_transfer_reward": {
      "title": "",
      "icon": {
        "item": {
          "id": "minecraft:air",
          "count": 0
        },
        "type": "heracles:item"
      },
      "item": {
        "id": "modern_industrialization:tin_cable",
        "count": 16
      },
      "type": "heracles:item"
    }
  },
  "display": {
    "subtitle": {
      "text": ""
    },
    "description": [
      "<hr/>",
      "# Energy Transfer",
      "<br/>",
      "  We have a lot to cover. Cable networks have hard limitations on the amount of energy they will pull into the network depending on the tier.  LV or Low Voltage cables have a maximum transfer rate of 256 EU/t and will not transfer at any higher rate no matter how large the network is. MV or Medium Voltage cables have a maximum transfer rate of 1024 EU/t. Finally, HV or High Voltage cables have a maximum transfer rate of 8192 EU/t. LV cables are made of Copper, Silver or Tin; MV cables are made of Cupronickel or Electrum; and so on...",
      "<br/>",
      "  Now, the input and transfer rate is hard capped, but the discharge rate is infinite. This mean, for example, a LV cable network can provide more than 256 EU/t for a short amount of time. The larger the cable network, the larger the internal cable buffer. All this \"stored\" energy can be discharged almost instantaneously if given a place to go to.",
      "<br/>",
      "  Do keep in mind that each tier of cable will --only-- connect to it's respective tier electric machine. A LV cable will not connect to steam machines, MV machines, or HV machines. The method that each machine uses to process and use electricity is different depending on the strength of the power it receives.",
      "<br/>",
      "  If you want to transfer more energy than the cable tier allows you to, you can either create multiple cable networks or use transformers. Transformers allow you to step up or step down your power. This means, for example, you can take LV power and turn it into HV power and vice versa.",
      "<br/>",
      "  As you'll see, an --X-- to --Y-- transformer will connect to --Y-- cables on its output side and --X-- cables on its 5 input sides. You can use your wrench to configure which side the output is.",
      "<br/>",
      "  Cables follow the same rules that fluid and item pipes follow. Using a wrench on them will disconnect connections and shift right clicking will break them, this time losing the power in that specific section of cable network.",
      "<hr/>"
    ],
    "groups": {
      "Modern Industrialization": {
        "position": [
          553,
          50
        ]
      }
    },
    "icon": {
      "item": {
        "id": "modern_industrialization:tin_cable",
        "count": 1
      },
      "type": "heracles:item"
    },
    "icon_background": "heracles:textures/gui/quest_backgrounds/default.png",
    "title": {
      "translate": "Energy Transfer"
    }
  },
  "settings": {
    "unlockNotification": false,
    "showDependencyArrow": true,
    "repeatable": false,
    "individual_progress": false,
    "hidden": "LOCKED"
  }
}