{
  "dependencies": [
    "nuclear_reactor"
  ],
  "tasks": {},
  "rewards": {},
  "display": {
    "subtitle": {
      "text": ""
    },
    "description": [
      "<hr/>",
      "# Give up?",
      "<br/>",
      "  Honestly, I cant blame you. Though if you've come here after you've made your super awesome reactor out of curiosity, I commend you. But for those of you that needed the help, why don't we begin? Pay attention!",
      "<br/>",
      "  The /b/Nuclear Reactor/b/ can produce 100s of times more EU/t than diesel can. It comes in several sizes from /b/small/b/ to /b/extreme/b/.",
      "<br/>",
      "  How it works under the hood can be a bit overwhelming, nevertheless, you don't need to understand the details to be able to design a powerful reactor.",
      "<br/>",
      "  Note that in this world, the /b/Nuclear Reactor/b/ --cannot-- explode, emit radiation, or otherwise damage the surrounding area. The only thing that it can damage is the items you put in it if the temperature gets too high, which I'll elaborate on more later. You should feel free to experiment, and enjoy your new life as a nuclear scientist!",
      "<br/>",
      "  The main component is the /b/Nuclear Casing/b/ which is made with /b/Nuclear Alloy/b/; a mix of /b/cadmium/b/, /b/beryllium/b/ and /b/blast-proof alloy/b/.",
      "<br/>",
      "  The upper part of the structure accepts /b/Nuclear Item/b/ or /b/Fluid Hatches/b/ or just simple casings. Those are the inputs and outputs of the reactor.",
      "<br/>",
      "  Each hatch has one input, whether that be either item or fluid, and two outputs. The input slots will form a grid, displayed in the reactor's control panel (accessible by right-clicking on the controller).",
      "<br/>",
      "  Each hatch has a temperature and stores heat which can be dissipated in several ways. The heat will naturally move to an adjacent hatch or to the outside if the hatch is on the edge, though this  will cause the heat to be lost. The speed of this process is equal to the hatch's content's heat transfer coefficient, which can be found in your REI, multiplied by the temperature difference. The heat can also be extracted in a fluid hatch by /b/producing steam/b/. A temperature above an item's maximum temperature will destroy it.",
      "<br/>",
      "  The core nuclear reactor elements are /b/neutrons/b/. Those are produced by the /b/nuclear fuel/b/. There are two type of neutrons, /b/fast/b/ and /b/thermal/b/: the fast carry energy while the thermal do not. Neutrons move in a straight line until they encounter an element or exit the reactor, though for fast neutrons, their energy is then lost. The flow of neutrons is shown in the reactor control panel.",
      "<br/>",
      "  When a neutron encounters a non-empty hatch, two things can happen, being either the neutron is absorbed or scattered. A scattered neutron will randomly change direction. If the scattered neutron is fast, it has a chance of slowing down, becoming a thermal one. This transfers the energy from the neutron to the hatch in the form of heat. An absorbed neutron stops its course and also transfers its energy if it was a fast neutron.",
      "<br/>",
      "  The number of absorbed neutrons in a single hatch can be seen in the control panel. The probability for each processes is shown in your REI. Those will strongly depend on the hatch's content and the neutron type, either fast or thermal. Nuclear fuels absorb thermal neutrons far better.",
      "<br/>",
      "  When a neutron, either fast or thermal, is absorbed in nuclear fuel, more neutrons are generated. Those are always fast neutrons and have random direction. Their generation is accompanied by the direct release of energy in the form of additional heat in the hatch.",
      "<br/>",
      "  Above a certain threshold, the number of generated neutrons will decrease with the temperature until reaching zero. This process wastes some energy, but guarantees the stability of the reactor. The number of generated neutrons, effective efficiency, the direct energy and temperature threshold are all shown in your REI.",
      "<br/>",
      "  Each nuclear component has maximum number of absorptions. When reached, the item is either destroyed or transformed into a depleted variant. This is particularly useful for nuclear fuel because some part of the U238 is transformed into Plutonium in its depleted variant, meaning some of it can be transformed back into fuel.",
      "<br/>",
      "  The same thing happens for fluids, where a bit of fluid is transformed after each neutron absorption. This can be used to mass produce useful isotopes like deuterium and tritium. In both cases, the outcome is shown in your REI.",
      "<hr/>"
    ],
    "groups": {
      "Modern Industrialization": {
        "position": [
          1237,
          35
        ]
      }
    },
    "icon": {
      "item": {
        "id": "modern_industrialization:nuclear_alloy_machine_casing_pipe",
        "count": 1
      },
      "type": "heracles:item"
    },
    "icon_background": "heracles:textures/gui/quest_backgrounds/default.png",
    "title": {
      "translate": "Give up?"
    }
  },
  "settings": {
    "unlockNotification": false,
    "showDependencyArrow": true,
    "repeatable": false,
    "individual_progress": false,
    "hidden": "LOCKED"
  }
}