{
  "dependencies": [
    "MI"
  ],
  "tasks": {
    "modern_industrialization_task": {
      "title": "",
      "icon": {
        "item": {
          "id": "minecraft:air",
          "count": 0
        },
        "type": "heracles:item"
      },
      "type": "heracles:check"
    }
  },
  "rewards": {
    "modern_industrialization_reward": {
      "icon": {
        "item": {
          "id": "minecraft:air",
          "count": 0
        },
        "type": "heracles:item"
      },
      "xptype": "POINTS",
      "amount": 50,
      "title": "",
      "type": "heracles:xp"
    }
  },
  "display": {
    "subtitle": {
      "text": ""
    },
    "description": [
      "<hr/>",
      "# Modern Industrialization",
      "<br/>",
      "  Have you read the book? Well, I'll give you a rundown of this technological journey anyway; you'll thank me.",
      "<br/>",
      "  What you'll be doing is practically --Modern Industrialization--, using a plethora of different mechanics from logistics to distillation to allowing for total automation. I'll give some examples:",
      "<br/>",
      "  You'll have access to powerful logistics tools such as multipart items and fluid pipes as well as energy cables. This means up to three of each can go into a single block!",
      "<br/>",
      "  You won't ever need to go mining for resources again as you'll have the ability to construct quarries for continuous resource generation!",
      "<br/>",
      "  You'll eventually need to power all your machines, steam or not. You'll have to use steam and oil processed into diesel through distillation, nuclear fission, and at total mechanical dominance: Fusion. You can boost energy transfer rates using higher voltages.",
      "<br/>",
      "  Never want to manually put together a gear or hammer out a rod ever again? Good thing this is a world for you to design. You'll be able to make a machine for just about anything! Total automation is completely possible and you can do it while flying around with a Gravi-chestplate.",
      "<br/>",
      "  Are you ready for the journey of a lifetime? Time to get going!",
      "<br/>",
      "  P.S. If you ever get stumped with a machine, go ahead and hold that guide book of yours while hovering over a machine or multiblock. It'll give you some extra info.",
      "<hr/>"
    ],
    "groups": {
      "Modern Industrialization": {
        "position": [
          50,
          0
        ]
      }
    },
    "icon": {
      "item": {
        "id": "computercraft:printed_book",
        "count": 1
      },
      "type": "heracles:item"
    },
    "icon_background": "heracles:textures/gui/quest_backgrounds/default.png",
    "title": {
      "translate": "Modern Industrialization"
    }
  },
  "settings": {
    "unlockNotification": false,
    "showDependencyArrow": true,
    "repeatable": false,
    "individual_progress": false,
    "hidden": "LOCKED"
  }
}